#### Terraform Plan 📋
**Environment:** `dev`
**Result:** failure

<details><summary>Show Plan</summary>

```terraform
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["main"].data.aws_partition.current: Reading...
module.ebs_csi_irsa_role.data.aws_region.current: Reading...
module.ebs_csi_irsa_role.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["main"].data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/k8s-ci-cd-dev/cluster]
aws_secretsmanager_secret.cicd: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:346135039532:secret:k8s-ci-cd/dev/cicd-secrets-H6i0zs]
module.ebs_csi_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.ebs_csi_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["main"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00b6ab676944e62a4]
module.external_secrets_irsa.data.aws_partition.current: Reading...
module.external_secrets_irsa.data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret.app: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:346135039532:secret:k8s-ci-cd/dev/app-secrets-D1Z7jq]
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Reading...
module.external_secrets_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=346135039532]
aws_ecr_repository.app: Refreshing state... [id=k8s-ci-cd-app]
module.eks.module.eks_managed_node_group["main"].data.aws_caller_identity.current: Read complete after 0s [id=346135039532]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
aws_iam_openid_connect_provider.github[0]: Refreshing state... [id=arn:aws:iam::346135039532:oidc-provider/token.actions.githubusercontent.com]
data.aws_caller_identity.current: Read complete after 0s [id=346135039532]
data.aws_availability_zones.available: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=346135039532]
module.eks.module.eks_managed_node_group["main"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["main"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.external_secrets_irsa.data.aws_region.current: Reading...
module.external_secrets_irsa.data.aws_caller_identity.current: Read complete after 0s [id=346135039532]
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=346135039532]
module.external_secrets_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=k8s-ci-cd-dev-cluster-20260203035544559200000002]
aws_iam_role.github_actions: Refreshing state... [id=github-actions-k8s-ci-cd-dev]
module.eks.module.eks_managed_node_group["main"].aws_iam_role.this[0]: Refreshing state... [id=k8s-ci-cd-dev-node-eks-node-group-20260203035544563500000005]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::346135039532:assumed-role/github-actions-k8s-ci-cd-dev/terraform-plan-dev-21618247306]
aws_secretsmanager_secret_version.cicd: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:346135039532:secret:k8s-ci-cd/dev/cicd-secrets-H6i0zs|terraform-20260203041721022300000003]
aws_secretsmanager_secret_version.app: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:346135039532:secret:k8s-ci-cd/dev/app-secrets-D1Z7jq|terraform-20260203041721026800000004]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=4189668531]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::346135039532:policy/k8s-ci-cd-dev-cluster-20260203035544559300000003]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Read complete after 0s [id=1795366970]
module.ebs_csi_irsa_role.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::346135039532:policy/AmazonEKS_EBS_CSI_Policy-20260203035545612400000006]
module.external_secrets_irsa.aws_iam_policy.external_secrets[0]: Refreshing state... [id=arn:aws:iam::346135039532:policy/AmazonEKS_External_Secrets_Policy-20260203041721075800000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=k8s-ci-cd-dev-cluster-20260203035544559200000002-20260203035546351000000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=k8s-ci-cd-dev-cluster-20260203035544559200000002-20260203035546353600000009]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3660256127]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=ad8db4c1-3cb5-40df-b37e-2a0ae1e24c29]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=k8s-ci-cd-dev-cluster-20260203035544559200000002-20260203035546350300000007]
module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=k8s-ci-cd-dev-node-eks-node-group-20260203035544563500000005-2026020303554642180000000b]
module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=k8s-ci-cd-dev-node-eks-node-group-20260203035544563500000005-2026020303554687020000000c]
module.eks.module.eks_managed_node_group["main"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=k8s-ci-cd-dev-node-eks-node-group-20260203035544563500000005-2026020303554635950000000a]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/k8s-ci-cd-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::346135039532:policy/k8s-ci-cd-dev-cluster-ClusterEncryption20260203035611315100000012]
aws_iam_role_policy.secrets_access: Refreshing state... [id=github-actions-k8s-ci-cd-dev:secrets-manager-access]
aws_iam_role_policy.terraform_access: Refreshing state... [id=github-actions-k8s-ci-cd-dev:terraform-access]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=k8s-ci-cd-dev-cluster-20260203035544559200000002-20260203035612252200000013]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-03a931516c19072bc]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03faf15cdc0563d34]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04c3ddc7ec90b7a58]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ceecfec70c79b507]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0cff81e0d4d173e77]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c61ef19edbc4ccbf]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0aac8e1ba087dd9e0]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-082d004330397aab4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00ef698b735968e0b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-031584a9cb21a9901]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09c3f3d13ec97d231]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05afff9c47caf9377]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a27269dcd0ce99a7]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-015a8a112c5a14d4b]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0be6075b0a2140521]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ceecfec70c79b5071080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0b8e494fd64e437b6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-004caf3d0e65d818e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d92e5ef8034361d0]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-262421466]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-388421401]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-208439777]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1784228987]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-523285952]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3597849174]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1685549953]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3456536468]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-45905787]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1758313002]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-557173295]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f83ca1a007bed735]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ba0827737abcff1c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01bc32c3323962bf7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ed75e02c0bf1a0a7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-031584a9cb21a99011080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=k8s-ci-cd-dev]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-01ecc85ec60170eee,Project]
module.eks.aws_ec2_tag.cluster_primary_security_group["ManagedBy"]: Refreshing state... [id=sg-01ecc85ec60170eee,ManagedBy]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=k8s-ci-cd-dev:arn:aws:iam::346135039532:user/Master-Admin]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-01ecc85ec60170eee,Environment]
module.eks.time_sleep.this[0]: Refreshing state... [id=2026-02-03T04:07:24Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=5916308764372507033]
module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-0857aa948a5164c94]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=b1b539daa206035ae3c3e28288b0681fa1b462f3]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::346135039532:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/5A10A31B341FC4A3DE666C028943F29E]
module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=k8s-ci-cd-dev:k8s-ci-cd-dev-node-20260203040732675000000018]
module.external_secrets_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1098973623]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=192526271]
module.external_secrets_irsa.aws_iam_role.this[0]: Refreshing state... [id=k8s-ci-cd-dev-external-secrets]
module.ebs_csi_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=k8s-ci-cd-dev-ebs-csi]
module.external_secrets_irsa.aws_iam_role_policy_attachment.external_secrets[0]: Refreshing state... [id=k8s-ci-cd-dev-external-secrets-20260203041722629500000006]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.ebs_csi_irsa_role.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=k8s-ci-cd-dev-ebs-csi-20260203040656995900000014]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=k8s-ci-cd-dev#arn:aws:iam::346135039532:user/Master-Admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=k8s-ci-cd-dev:kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=k8s-ci-cd-dev:coredns]
module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=k8s-ci-cd-dev:vpc-cni]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=k8s-ci-cd-dev:aws-ebs-csi-driver]
aws_iam_role_policy.eks_access: Refreshing state... [id=github-actions-k8s-ci-cd-dev:eks-access]
aws_eks_access_entry.github_actions: Refreshing state... [id=k8s-ci-cd-dev:arn:aws:iam::346135039532:role/github-actions-k8s-ci-cd-dev]
aws_eks_access_policy_association.github_actions: Refreshing state... [id=k8s-ci-cd-dev#arn:aws:iam::346135039532:role/github-actions-k8s-ci-cd-dev#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
time_sleep.wait_for_eks: Refreshing state... [id=2026-02-03T04:10:30Z]
helm_release.ingress_nginx: Refreshing state... [id=ingress-nginx]
helm_release.external_secrets: Refreshing state... [id=external-secrets]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role_policy.terraform_access will be updated in-place
  ~ resource "aws_iam_role_policy" "terraform_access" {
        id          = "github-actions-k8s-ci-cd-dev:terraform-access"
        name        = "terraform-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (9 unchanged elements hidden)
                    {
                        Action   = [
                            "sts:GetCallerIdentity",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "STSGetCallerIdentity"
                    },
                  + {
                      + Action   = [
                          + "ecr:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECRFullAccess"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:346135039532:access-entry/k8s-ci-cd-dev/user/346135039532/Master-Admin/1ace10dc-0eb5-8419-d3e2-f00d7d0742aa" -> (known after apply)
      ~ created_at        = "2026-02-03T04:17:20Z" -> (known after apply)
      ~ id                = "k8s-ci-cd-dev:arn:aws:iam::346135039532:user/Master-Admin" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2026-02-03T04:17:20Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::346135039532:user/Master-Admin" -> "arn:aws:iam::346135039532:role/github-actions-k8s-ci-cd-dev" # forces replacement
        tags              = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "k8s-ci-cd"
        }
      ~ user_name         = "arn:aws:iam::346135039532:user/Master-Admin" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2026-02-03 04:17:21.472 +0000 UTC" -> (known after apply)
      ~ id            = "k8s-ci-cd-dev#arn:aws:iam::346135039532:user/Master-Admin#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2026-02-03 04:17:21.472 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::346135039532:user/Master-Admin" -> "arn:aws:iam::346135039532:role/github-actions-k8s-ci-cd-dev" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "ad8db4c1-3cb5-40df-b37e-2a0ae1e24c29"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::346135039532:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::346135039532:user/Master-Admin" -> "arn:aws:iam::346135039532:role/github-actions-k8s-ci-cd-dev"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::346135039532:role/k8s-ci-cd-dev-cluster-20260203035544559200000002"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "ManagedBy"             = "terraform"
            "Project"               = "k8s-ci-cd"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```

</details>